Ran Plan for project: `caju-bff-staging` dir: `iac/environments/staging` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.ecr-sponsor[0].data.aws_caller_identity.current: Reading...
module.ecr-sponsor[0].data.aws_partition.current: Reading...
module.ecr-employee[0].data.aws_partition.current: Reading...
module.ecr-employee[0].data.aws_caller_identity.current: Reading...
module.ecr-employee[0].data.aws_partition.current: Read complete after 0s [id=aws]
module.ecr-sponsor[0].data.aws_partition.current: Read complete after 0s [id=aws]
module.ecr-employee[0].data.aws_caller_identity.current: Read complete after 1s [id=175174716971]
module.ecr-sponsor[0].data.aws_caller_identity.current: Read complete after 1s [id=175174716971]
module.ecr-sponsor[0].data.aws_iam_policy_document.repository[0]: Reading...
module.ecr-employee[0].data.aws_iam_policy_document.repository[0]: Reading...
module.ecr-sponsor[0].data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=2465834129]
module.ecr-employee[0].data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=2465834129]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.ecr-employee[0].aws_ecr_repository.this[0] will be created
+ resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "employee-onboarding"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "environment" = "staging"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr-employee[0].aws_ecr_repository_policy.this[0] will be created
+ resource "aws_ecr_repository_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:ListTagsForResource",
                          + "ecr:ListImages",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetLifecyclePolicyPreview",
                          + "ecr:GetLifecyclePolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:DescribeImageScanFindings",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::175174716971:root"
                        }
                      + Sid       = "PrivateReadOnly"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "employee-onboarding"
    }

  # module.ecr-sponsor[0].aws_ecr_repository.this[0] will be created
+ resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "sponsor-onboarding"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "environment" = "staging"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr-sponsor[0].aws_ecr_repository_policy.this[0] will be created
+ resource "aws_ecr_repository_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:ListTagsForResource",
                          + "ecr:ListImages",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetLifecyclePolicyPreview",
                          + "ecr:GetLifecyclePolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:DescribeImageScanFindings",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::175174716971:root"
                        }
                      + Sid       = "PrivateReadOnly"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "sponsor-onboarding"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p caju-bff-staging`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.k8s.caju.prod.in/lock?id=caju-beneficios%252Fcaju-bff%252Fiac%252Fenvironments%252Fstaging%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p caju-bff-staging`
</details>
Plan: 4 to add, 0 to change, 0 to destroy.